insert into artists (artist_name)
values 
('Сплин'),
('Zемфира'),
('Кино'),
('Би-2'),
('Агата Кристи'),
('Аквариум'),
('Мумий Тролль'),
('Nautilus Pompilius');

insert into genre (ganre_name)
values
('russian rock'),
('rock'),
('alternative'),
('pop-rock'),
('russian');

insert into genreartists 
values
(1,1),(2,1),
(3,1),(4,2),
(5,3),(2,3),
(1,4),(4,4),
(2,5),(1,5),
(3,5),(1,6),
(2,7),(5,7),
(4,8),(1,8);

insert into albums (album_name, year_of_pabl)
values
('Раздвоение личности', '2018-01-18'),
('Горизонт событий', '2017-09-29'),
('Би-2', '2019-04-10'),
('Иномарки', '2004-03-02'),
('Беспечный русский бродяга', '2006-01-01'),
('Дети Декабря', '1986-01-13'),
('Слияни и Поглащение', '2005-04-19'),
('Контрабадна', '2008-06-13');

insert into albumsartists 
values
(1,1),(2,4),(3,4),(4,4),
(5,6),(6,6),(7,7),(8,7);

insert into tracks (track_name, duration, album_id)
values 
('Лётчик', '00:05:31', 2),('Черное сердце', '00:05:31', 2),('Мой друг', '00:04:50', 3),
('Варвара', '00:05:04', 3),('Песок', '00:04:13', 4),('Она', '00:04:54', 4),
('Скажи', '00:03:05', 1),('Маяк', '00:03:48', 1),('Стаканы', '00:02:43', 5),
('Беспечный русский бродяга', '00:04:50', 5),('Жажда', '00:03:50', 6),('Деревня', '00:04:44', 6),
('Приватизация', '00:03:31', 7),('Банзай', '00:02:51', 7),('Мамы дочерей', '00:05:33', 8),('Музыкант', '00:03:41', 8);

insert into collection (coll_name, year_of_pabl)
values
('Сборник', '2018-04-23'),('Новая папка', '2019-01-01'),
('Так себе сборник', '2015-12-03'),('Могло быть хуже', '2022-07-10'),
('Деньги потрачены зря', '2015-10-10'),('Кровь из ушей', '2019-12-21'),
('Лучший сборник', '2013-04-17'),('Самый лучший сборник', '2018-07-11');

insert into trackcollection 
values 
(1, 1),(2, 1),(7, 1),(4, 1),
(2, 2),(3, 2),(1, 2),(15, 2),
(4, 3),(1, 3),(14, 3),(13, 3),
(4, 4),(14, 4),(5, 4),(11, 4),
(1, 5),(2, 5),(3, 5),(10, 5),
(4, 6),(7, 6),(9, 6),(14, 6),
(1, 7),(11, 7),(12, 7),(15, 7),
(10, 8),(7, 8),(5, 8),(6, 8);



